[
    {
      "title": "JT-262HS Back Pocket Hemming Machine",
      "shortDescription": "Advanced machine for precise pocket stitching, enhancing garment production efficiency and quality.",
      "description": "The JT-262HS is designed for high-quality pocket stitching, suitable for various fabrics. Its advanced technology ensures durability and efficiency in production. This machine minimizes errors and provides reliable performance, making it ideal for both industrial and home sewing applications. Enhance your garment manufacturing with this precision tool for impeccable pocket finishes.",
      "specifications": {
        "Stitch Type": "Straight stitch",
        "Speed": "Up to 1200 stitches per minute",
        "Needle Type": "Industrial-grade needles",
        "Motor": "High-efficiency motor"
      },
      "machinesEquipped": [
        "Sewing machine for straight and decorative stitching.",
        "Fabric cutter for precise and clean fabric cuts.",
        "Overlock machine for finishing fabric edges efficiently.",
        "Thread trimmer for quick and easy thread management."
      ],
      "images": "https://i.ibb.co.com/3mMVR2V/jam1.png",
      "category": "jam_international",
      "video":"",
      "popularCategory":""
    },
    {
      "title": "JT-263HS Back Pocket Hemming Machine",
      "shortDescription": "Specialized machine designed for efficient back pocket hamming, improving production speed and stitch quality.",
      "description": "The JT-263HS efficiently hams back pockets on denim and similar materials, ensuring robust and consistent stitch quality. It is designed to enhance production efficiency while accommodating various fabric thicknesses. The machine's user-friendly interface allows for easy operation and adjustments, making it a reliable choice for garment manufacturers looking to streamline their pocket application process.",
      "specifications": {
        "Stitch Type": "Hemming stitch",
        "Speed": "Up to 1000 stitches per minute",
        "Needle Type": "Heavy-duty needle",
        "Motor": "Energy-efficient motor"
      },
      "machinesEquipped": [
        "Hemming machine for precise and uniform hems.",
        "Sewing machine for versatile stitching applications.",
        "Cutting machine for accurate fabric shaping.",
        "Finishing machine for final touches on garments."
      ],
      "images": "https://i.ibb.co.com/3mMVR2V/jam1.png",
      "category": "jam_international",
      "video":"",
      "popularCategory":""
    },
    {
      "title": "JT-862H Single Head Automatic Back Pocket Attachment Machine",
      "shortDescription": "Automatic back pocket attachment machine designed for efficiency, improving production speed and precision in garment manufacturing.",
      "description": "The JT-862H automates the pocket attachment process, ensuring precise placement on garments. Its single-head design allows for high-speed operation, accommodating various pocket styles and sizes. This machine is essential for modern garment production lines, significantly enhancing productivity while maintaining high-quality stitching standards. Ideal for factories focused on efficiency and reliability in their sewing processes.",
      "specifications": {
        "Operation": "Automatic pocket attachment",
        "Speed": "High-speed stitching",
        "Pocket Types": "Various styles",
        "Control System": "User-friendly interface"
      },
      "machinesEquipped": [
        "Pocket attachment machine for efficient pocket application.",
        "Sewing machine for versatile stitching tasks.",
        "Cutting machine for precise fabric cuts.",
        "Pressing machine for creating smooth finishes."
      ],
      "images": "https://i.ibb.co.com/4ZVC5Yv/jam2.png",
      "category": "jam_international",
      "video":"",
      "popularCategory":""
    },
    {
      "title": "JT-882H Double Head Automatic Back Pocket Attach",
      "shortDescription": "Double head automatic pocket setter designed for jeans, enhancing speed and precision in pocket application processes.",
      "description": "The JT-882H features a double head design, allowing for simultaneous pocket application on jeans and similar fabrics. This machine significantly increases production efficiency, providing precise pocket placements and high-quality stitching. With adjustable settings for various pocket styles, it is perfect for high-volume garment manufacturers aiming to boost productivity without compromising on stitch quality.",
      "specifications": {
        "Operation": "Double head automatic setting",
        "Speed": "Rapid pocket application",
        "Fabric Compatibility": "Suitable for jeans and heavy fabrics",
        "Adjustment": "Easy size and position adjustments"
      },
      "machinesEquipped": [
        "Pocket setter machine for fast and accurate application.",
        "Sewing machine for detailed stitching on garments.",
        "Cutting machine for shaping and sizing fabric.",
        "Folding machine for preparing fabric for sewing."
      ],
      "images": "https://i.ibb.co.com/3FkCb9j/jam3.png",
      "category": "jam_international",
      "video":"",
      "popularCategory":"popular"
    },
    {
      "id": "jt-132g",
      "title": "JT-132G Back Pocket Decorative Stitch Machine",
      "shortDescription": "Specialized for decorative stitching on back pockets, enhancing aesthetic appeal in denim and similar fabrics.",
      "description": "The JT-132G creates intricate decorative stitches on back pockets, elevating garment aesthetics and customization. With various stitch patterns available, it provides manufacturers with the flexibility to meet diverse design needs. This machine combines functionality and style, making it ideal for adding unique touches to denim and other garments while ensuring high-quality stitching performance.",
      "specifications": {
        "Stitch Types": "Various decorative stitches",
        "Speed": "High-speed operation",
        "Needle System": "Versatile needle system",
        "Control Type": "Electronic control panel"
      },
      "machinesEquipped": [
        "Decorative stitch machine for creative design applications.",
        "Sewing machine for various stitching techniques.",
        "Embroidery machine for intricate fabric designs.",
        "Overlock machine for clean fabric edges."
      ],
      "images": "https://i.ibb.co.com/Y2szCSb/jam4.png",
      "category": "jam_international",
      "video":"",
      "popularCategory":""
    },
    {
      "id": "jt-121g",
      "title": "JT-121G J-Stitch Machine",
      "shortDescription": "Versatile J-stitch machine designed for high-quality stitching tasks, enhancing operational efficiency across various fabrics.",
      "description": "The JT-121G J-Stitch Machine produces high-quality J-stitches for various fabric types, ensuring durability and precision. With its user-friendly controls and robust construction, this machine is suitable for both industrial and home sewing applications. It minimizes downtime and maximizes output, making it an essential tool for manufacturers seeking reliable performance in their stitching processes.",
      "specifications": {
        "Stitch Type": "J-stitch",
        "Speed": "Up to 1000 stitches per minute",
        "Needle Type": "Industrial-grade needles",
        "Motor": "High-efficiency motor"
      },
      "machinesEquipped": [
        "Sewing machine for multiple stitching tasks and techniques.",
        "Fabric cutter for clean and accurate fabric cutting.",
        "Overlock machine for neat edge finishing.",
        "Thread trimmer for efficient thread management."
      ],
      "images": "https://i.ibb.co.com/LhCY1tN/jam5.png",
      "category": "jam_international",
      "video":"",
      "popularCategory":""
    },
    {
      "title": "JT-908A Feed of the Arm Unit",
      "shortDescription": "Unit with differential feed dogs designed for smooth fabric handling, ensuring accurate stitching in garment production.",
      "description": "The JT-908A Feed of the Arm Unit enhances fabric feeding capabilities with differential feed dogs, optimizing stitch quality. This unit is ideal for handling various fabric types, ensuring smooth feeding and precise stitching results. Its innovative design contributes to consistent performance in garment manufacturing, enhancing overall production efficiency and quality in finished products.",
      "specifications": {
        "Feed Mechanism": "Differential feed",
        "Arm Design": "Feed of the arm design",
        "Speed": "Adjustable stitching speed",
        "Fabric Compatibility": "Various fabric types"
      },
      "machinesEquipped": [
        "Sewing machine for versatile stitching applications.",
        "Cutting machine for precise fabric shaping.",
        "Folding machine for efficient fabric management.",
        "Binding machine for finishing raw edges smoothly."
      ],
      "images": "https://i.ibb.co.com/qJp1vXy/jam6.png",
      "category": "jam_international",
      "video":"",
      "popularCategory":""
    },
    {
      "title": "JT-801P Automatic Belt Loop Setter Machine",
      "shortDescription": "Automatic machine for belt loop setting, enhancing productivity and consistency in garment manufacturing processes.",
      "description": "The JT-801P Automatic Belt Loop Setter Machine streamlines the belt loop application process, ensuring quick and consistent results. Its advanced automation technology allows for precise loop placement, accommodating various styles and sizes. Ideal for high-volume production lines, this machine provides reliable performance and high-quality finishes, making it essential for garment manufacturers focused on efficiency.",
      "specifications": {
        "Operation": "Automatic belt loop setting",
        "Speed": "High-speed operation",
        "Loop Size": "Adjustable loop sizes",
        "Control System": "User-friendly control panel"
      },
      "machinesEquipped": [
        "Belt loop machine for efficient loop application.",
        "Cutting machine for accurate sizing of fabric.",
        "Sewing machine for durable stitching applications.",
        "Finishing machine for quality checks and final touches."
      ],
      "images": "https://i.ibb.co.com/sHbrMHC/jam7.png",
      "category": "jam_international",
      "video":"",
      "popularCategory":""
    },
    {
      "title": "JT-418 Automatic Continuous Waistband Machine for Jeans and Similar",
      "shortDescription": "Automatic machine for continuous waistband application, ensuring efficiency and precision in jeans and similar garments.",
      "description": "The JT-418 Automatic Continuous Waistband Machine specializes in efficiently applying waistbands on jeans and similar garments. Its automatic operation maximizes productivity while ensuring high-quality finishes. The machine can handle various waistband styles, providing flexibility and precision in garment manufacturing, making it a valuable asset for production facilities focused on quality and efficiency.",
      "specifications": {
        "Operation": "Automatic continuous waistband application",
        "Sewing speed": "4000 rpm",
        "Power source":"220 Vac – 50/60 Hz",
        "Waistband Types": "Multiple waistband styles",
        "Adjustment": "Easy size adjustments"
      },
      "machinesEquipped": [
        "Waistband machine for consistent waistband application.",
        "Sewing machine for versatile stitching tasks.",
        "Cutting machine for precise fabric sizing.",
        "Pressing machine for finishing waistband edges smoothly."
      ],
      "images": "https://i.ibb.co.com/9HH4c5H/jam8.png",
      "category": "jam_international",
      "video":"",
      "popularCategory":""
    },
    {
      "title": "JT-115G Electronic Programmable Repairing Stitch Machine",
      "shortDescription": "Programmable machine for repairing stitches, enhancing quality and efficiency in garment production processes.",
      "description": "The JT-115G Electronic Programmable Repairing Stitch Machine offers advanced programming features for precision stitching repairs. Designed to handle a variety of fabric types, this machine ensures high-quality repairs with minimal effort. Its electronic controls allow for easy adjustments, making it suitable for both industrial and home sewing applications, enhancing efficiency in garment maintenance and production.",
      "specifications": {
        "Operation": "Electronic programmable stitching",
        "Speed": "Adjustable stitching speed",
        "Fabric Compatibility": "Various fabric types",
        "Control Type": "User-friendly electronic interface"
      },
      "machinesEquipped": [
        "Repairing stitch machine for various fabric types.",
        "Sewing machine for durable and precise stitching.",
        "Cutting machine for efficient fabric handling.",
        "Finishing machine for final quality checks."
      ],
      "images": "https://i.ibb.co.com/6ZNmsgR/jam9.png",
      "category": "jam_international",
      "video":"",
      "popularCategory":""
    },
    {
        "title": "SQ7803LR/PF-HB/AF/DD/PT Slide Seam Machine for Jeans",
        "shortDescription": "Specialized machine for slide seam stitching on jeans, enhancing quality and efficiency.",
        "description": "The SQ7803LR is designed for slide seam stitching on jeans, providing durability and precision in stitching. This machine effectively handles various denim thicknesses, ensuring high-quality seams for enhanced garment durability. With its advanced technology and user-friendly interface, it is perfect for both industrial and home sewing, meeting the demands of modern garment production.",
        "specifications": {
          "Stitch Type": "Slide seam",
          "Speed": "Up to 1000 stitches per minute",
          "Needle Type": "Heavy-duty needle",
          "Motor": "High-efficiency motor"
        },
        "machinesEquipped": [
          "Overlock machine for finishing raw fabric edges neatly.",
          "Cutting machine for precise fabric shaping and sizing.",
          "Sewing machine for versatile stitching applications.",
          "Pressing machine for smoothing fabric and seams efficiently."
        ],
        "image": "https://i.ibb.co.com/VmhNXpN/kansai1.png",
        "category": "kansai",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "NC1103GALK-UTA T-Shirt Bottom Hemming Machine",
        "shortDescription": "Automatic bottom hemming machine designed for T-shirts, improving production speed and quality.",
        "description": "The NC1103GALK-UTA T-Shirt Bottom Hemming Machine automates the hemming process, providing consistent results for T-shirt production. Its advanced technology ensures accurate and durable hems, significantly reducing labor time and enhancing productivity. Ideal for high-volume production lines, this machine guarantees high-quality finishes while accommodating various fabric types, making it an essential tool for garment manufacturers.",
        "specifications": {
          "Operation": "Automatic bottom hemming",
          "Speed": "Up to 1200 stitches per minute",
          "Fabric Compatibility": "Various fabric types",
          "Adjustment": "Easy hem length adjustments"
        },
        "machinesEquipped": [
          "Sewing machine for detailed stitching tasks.",
          "Overlock machine for clean edge finishing.",
          "Cutting machine for fabric sizing and shaping.",
          "Folding machine for preparing fabric for hemming."
        ],
        "image": "https://i.ibb.co.com/Mpn2Mh7/kansai2.png",
        "category": "kansai",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "WFB5509PA-3WAC Automatic Waistband Attaching Semi-cylinder Bed Needle Feed Machine for Jeans and Twill",
        "shortDescription": "Semi-cylinder bed needle feed machine for attaching waistbands on jeans and twill fabrics.",
        "description": "The WFB5509PA-3WAC is a semi-cylinder bed machine designed for automatic waistband attachment on jeans and twill. Its needle feed technology ensures precise fabric handling and consistent stitching quality, accommodating various waistband sizes. Ideal for high-volume production environments, this machine enhances efficiency while maintaining high-quality finishes, making it a valuable addition to garment manufacturing lines.",
        "specifications": {
          "Operation": "Automatic waistband attachment",
          "Fabric Types": "Jeans and twill",
          "Needle Feed": "Precision needle feed technology",
          "Speed": "High-speed operation"
        },
        "machinesEquipped": [
          "Waistband machine for efficient waistband application.",
          "Sewing machine for versatile stitching tasks.",
          "Cutting machine for accurate fabric shaping.",
          "Finishing machine for quality control and final touches."
        ],
        "image": "https://i.ibb.co.com/QcG7zkh/kansai3.png",
        "category": "kansai",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "JJ Series Overlock Machine",
        "shortDescription": "Efficient overlock machine designed for clean and durable seam finishing.",
        "description": "The JJ Series Overlock Machine provides high-quality seam finishing, ideal for a variety of fabrics. It ensures clean edges and prevents fraying, enhancing garment durability. With adjustable stitch settings and speeds, it accommodates different fabric types, making it suitable for both industrial and home use. This machine is essential for achieving professional-quality finishes in garment production.",
        "specifications": {
          "Stitch Type": "Overlock stitch",
          "Speed": "Up to 800 stitches per minute",
          "Needle Type": "Standard overlock needles",
          "Motor": "High-efficiency motor"
        },
        "machinesEquipped": [
          "Overlock machine for clean and durable seams.",
          "Sewing machine for versatile stitching applications.",
          "Cutting machine for accurate fabric sizing.",
          "Finishing machine for final quality checks."
        ],
        "image": "https://i.ibb.co.com/6b3rnbP/kansai4.png",
        "category": "kansai",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "FBX1106P Waistband Attach Machine",
        "shortDescription": "Specialized machine for attaching waistbands, enhancing efficiency and precision in production.",
        "description": "The FBX1106P Waistband Attach Machine is designed for high-speed waistband attachment on various garments. Its efficient operation ensures consistent results, reducing labor time and improving production efficiency. The machine accommodates different waistband styles, providing flexibility for garment manufacturers. With its durable construction, it guarantees reliable performance in high-volume production environments.",
        "specifications": {
          "Operation": "Waistband attachment",
          "Speed": "High-speed operation",
          "Fabric Compatibility": "Various fabric types",
          "Adjustment": "Easy size adjustments"
        },
        "machinesEquipped": [
          "Waistband attach machine for fast and accurate application.",
          "Sewing machine for versatile stitching tasks.",
          "Cutting machine for precise fabric shaping.",
          "Pressing machine for ensuring quality finishes."
        ],
        "image": "https://i.ibb.co.com/t8WgvhG/kansai5.png",
        "category": "kansai",
        "video":"",
      "popularCategory":"popular"
      },
      {
        "title": "FX4418P Waistband Attach Machine",
        "shortDescription": "Efficient machine for attaching waistbands, improving speed and quality in garment production.",
        "description": "The FX4418P Waistband Attach Machine streamlines the waistband application process, ensuring quick and precise results. Designed for high-volume production, it accommodates various waistband types and styles, enhancing flexibility in garment manufacturing. This machine is essential for manufacturers looking to improve their operational efficiency while maintaining high standards of stitch quality and durability in their products.",
        "specifications": {
          "Operation": "Waistband attachment",
          "Speed": "Rapid stitching speed",
          "Fabric Compatibility": "Multiple fabric types",
          "Adjustment": "User-friendly adjustments"
        },
        "machinesEquipped": [
          "Waistband machine for quick and accurate application.",
          "Sewing machine for versatile stitching tasks.",
          "Cutting machine for shaping and sizing fabric.",
          "Finishing machine for final quality checks."
        ],
        "image": "https://i.ibb.co.com/sHPQrxf/kansai6.png",
        "category": "kansai",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "NW8842-1G Flatbed Pocket Facing Machine",
        "shortDescription": "Machine designed for flatbed pocket facing, enhancing quality in garment finishing.",
        "description": "The NW8842-1G Flatbed Pocket Facing Machine is designed for precise pocket facings, ensuring clean and professional finishes on garments. It enhances productivity while maintaining high-quality stitching standards. Suitable for various fabric types, this machine is ideal for garment manufacturers focused on achieving consistent results in their pocket application processes, streamlining their production lines effectively.",
        "specifications": {
          "Operation": "Pocket facing",
          "Speed": "Efficient stitching speed",
          "Fabric Compatibility": "Various fabric types",
          "Adjustment": "Simple size adjustments"
        },
        "machinesEquipped": [
          "Pocket facing machine for precise and clean finishes.",
          "Sewing machine for detailed stitching tasks.",
          "Cutting machine for accurate sizing of fabric.",
          "Pressing machine for ensuring quality finishes."
        ],
        "image": "https://i.ibb.co.com/7NLYZvw/kansai8.png",
        "category": "kansai",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "NB1433PSSM-ET Smocking & Shearing Machine",
        "shortDescription": "Specialized machine for smocking and shearing, enhancing garment design and quality.",
        "description": "The NB1433PSSM-ET Smocking & Shearing Machine enables intricate designs with smocking and shearing techniques, perfect for enhancing garment aesthetics. Its advanced features ensure precise stitching, accommodating various fabric types. This machine is essential for fashion designers and manufacturers looking to create unique, high-quality garments, providing flexibility and creativity in their production processes.",
        "specifications": {
          "Operation": "Smocking and shearing",
          "Speed": "High stitching speed",
          "Fabric Compatibility": "Multiple fabric types",
          "Control System": "User-friendly interface"
        },
        "machinesEquipped": [
          "Smocking machine for decorative stitching applications.",
          "Sewing machine for versatile stitching tasks.",
          "Cutting machine for accurate fabric handling.",
          "Finishing machine for final quality checks."
        ],
        "image": "https://i.ibb.co.com/c8crkXM/kansai9.png",
        "category": "kansai",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "GC 6925A Smart Touch Panel Single Needle Lockstitch Machine",
        "shortDescription": "Advanced single needle lockstitch machine with smart touch panel for precision sewing operations.",
        "description": "The GC 6925A Smart Touch Panel Single Needle Lockstitch Machine provides precise control over stitching with its intuitive smart panel. It’s designed for high-quality stitching on a variety of fabrics, improving efficiency and precision in garment production. Ideal for both industrial and small-scale operations, it delivers consistent stitching performance.",
        "specifications": {
          "Operation": "Single needle lockstitch",
          "Control": "Smart touch panel",
          "Speed": "Up to 5000 stitches per minute",
          "Compatibility": "Various fabric types"
        },
        "machinesEquipped": [
          "Single needle lockstitch machine for precision sewing tasks.",
          "Cutting machine for accurate fabric shaping and trimming.",
          "Overlock machine for edge finishing.",
          "Pressing machine for smooth seams and finishing."
        ],
        "image": "https://i.ibb.co.com/1nd96k7/t1.png",
        "category": "typical",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "GC 6880A Direct Drive Single Needle Machine Intelligent Lockstitch with Trimmer",
        "shortDescription": "Direct drive single needle machine with intelligent lockstitch and automatic trimmer for enhanced sewing efficiency.",
        "description": "The GC 6880A features direct drive technology for energy efficiency and high-speed performance. It includes an automatic trimmer, making it ideal for garment production lines seeking to improve workflow. Its intelligent lockstitch ensures clean, consistent stitches across various fabric types, suitable for high-volume manufacturing.",
        "specifications": {
          "Operation": "Single needle lockstitch with trimmer",
          "Speed": "Up to 6000 stitches per minute",
          "Drive": "Direct drive technology",
          "Trimmer": "Automatic thread trimmer"
        },
        "machinesEquipped": [
          "Single needle machine for precise stitching.",
          "Trimmer for automatic thread cutting.",
          "Overlock machine for edge finishing.",
          "Pressing machine for quality fabric pressing."
        ],
        "image": "https://i.ibb.co.com/47H9VVs/t2.png",
        "category": "typical",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "GK 31600YD3 Direct Drive Cylinder Bed Interlock Sewing Machine with Automatic Trimmer and Left Hand Side Fabric Cutter",
        "shortDescription": "Direct drive interlock sewing machine with automatic trimmer and left-hand fabric cutter for industrial sewing applications.",
        "description": "The GK 31600YD3 offers cylinder bed interlock stitching with a direct drive system, providing high-speed performance and precision. Its automatic trimmer and left-hand fabric cutter make it ideal for sewing operations requiring consistent, high-quality stitches. Designed for durability and efficiency, it’s perfect for heavy-duty fabric applications.",
        "specifications": {
          "Operation": "Cylinder bed interlock stitching",
          "Speed": "High-speed operation",
          "Trimmer": "Automatic trimmer",
          "Cutter": "Left-hand side fabric cutter"
        },
        "machinesEquipped": [
          "Interlock machine for durable stitching on heavy fabrics.",
          "Trimmer for automatic thread trimming.",
          "Cutter for precise fabric cutting.",
          "Pressing machine for smooth finishing."
        ],
        "image": "https://i.ibb.co.com/Vwd6MP7/t3.png",
        "category": "typical",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "GK 339 YD3 Direct Drive High-Speed Mini Cylinder Interlock Chainstitch Sewing Machine With Auto Thread Trimmer",
        "shortDescription": "High-speed direct drive mini cylinder interlock chainstitch sewing machine with auto thread trimmer for efficiency.",
        "description": "The GK 339 YD3 is a high-speed mini cylinder interlock chainstitch machine with a direct drive system, perfect for industrial garment production. It features an automatic thread trimmer, ensuring high-quality stitching and efficient workflow. Its compact design makes it versatile for various sewing tasks, especially on curved fabrics.",
        "specifications": {
          "Operation": "Mini cylinder interlock chainstitch",
          "Speed": "High-speed operation",
          "Drive": "Direct drive",
          "Trimmer": "Automatic thread trimmer"
        },
        "machinesEquipped": [
          "Interlock machine for durable and efficient stitching.",
          "Trimmer for automatic thread cutting.",
          "Cutter for fabric shaping and trimming.",
          "Pressing machine for fabric finishing."
        ],
        "image": "https://i.ibb.co.com/82VdGzz/t4.png",
        "category": "typical",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "GN 7100 Super High Speed Full Automatic Overlock Sewing Machine",
        "shortDescription": "Super high-speed full automatic overlock machine for fast and efficient seam finishing in garment production.",
        "description": "The GN 7100 is a super high-speed overlock machine designed for fast and efficient seam finishing. It’s fully automatic, allowing for increased productivity in garment manufacturing lines. Its precision stitching ensures clean and durable edges on a variety of fabric types, making it an essential machine for modern garment factories.",
        "specifications": {
          "Operation": "Full automatic overlock",
          "Speed": "Super high-speed",
          "Fabric Compatibility": "Various fabric types",
          "Control": "Automatic control system"
        },
        "machinesEquipped": [
          "Overlock machine for edge finishing.",
          "Sewing machine for versatile stitching tasks.",
          "Cutting machine for fabric shaping.",
          "Pressing machine for smooth seams."
        ],
        "image": "https://i.ibb.co.com/x7k6Ypm/t5.png",
        "category": "typical",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "GT 9820A Electronic Eyelet Button Holing Machine",
        "shortDescription": "Electronic button holing machine with eyelet function for high-speed, precise buttonhole creation in garments.",
        "description": "The GT 9820A Electronic Eyelet Button Holing Machine is designed for high-speed, precision buttonhole creation, featuring an electronic control system. Its eyelet function allows for clean, consistent buttonholes on various fabric types. This machine is perfect for garment manufacturers focused on producing high-quality finishes with minimal manual intervention.",
        "specifications": {
          "Operation": "Electronic eyelet button holing",
          "Speed": "High-speed button holing",
          "Control": "Electronic control system",
          "Fabric Compatibility": "Various fabric types"
        },
        "machinesEquipped": [
          "Button holing machine for precise buttonhole creation.",
          "Sewing machine for versatile stitching tasks.",
          "Overlock machine for edge finishing.",
          "Cutting machine for fabric shaping."
        ],
        "image": "https://i.ibb.co.com/cXWJKzf/t6.png",
        "category": "typical",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "GT 6430 H High Speed Direct Drive Electronic Lock Stitch Bar-Tacking Machine",
        "shortDescription": "High-speed direct drive lock stitch bar-tacking machine for industrial garment reinforcement.",
        "description": "The GT 6430 H offers high-speed bar-tacking for garment reinforcement, ideal for high-volume production. Its direct drive system enhances performance and efficiency, while its electronic controls allow for easy operation. Designed for durability, it ensures consistent and precise stitching, making it perfect for industrial garment manufacturing.",
        "specifications": {
          "Operation": "Direct drive lock stitch bar-tacking",
          "Speed": "High-speed operation",
          "Control": "Electronic controls",
          "Reinforcement": "Designed for garment reinforcement"
        },
        "machinesEquipped": [
          "Bar-tacking machine for garment reinforcement.",
          "Sewing machine for versatile stitching tasks.",
          "Overlock machine for seam finishing.",
          "Pressing machine for smooth garment finishing."
        ],
        "image": "https://i.ibb.co.com/Thbbfct/t7.png",
        "category": "typical",
        "video":"",
      "popularCategory":"popular"
      },
      {
        "title": "TC 6030 G Programmable Electronic Pattern Machine",
        "shortDescription": "Programmable electronic pattern machine for creating custom stitching patterns in garment production.",
        "description": "The TC 6030 G Programmable Electronic Pattern Machine allows for the creation of custom stitching patterns with precision. Ideal for garment production lines that require complex designs, this machine’s programmable features offer flexibility and efficiency. It accommodates various fabric types and ensures consistent, high-quality stitching results.",
        "specifications": {
          "Operation": "Programmable electronic pattern stitching",
          "Speed": "Adjustable stitching speed",
          "Pattern Control": "Customizable electronic patterns",
          "Fabric Compatibility": "Various fabric types"
        },
        "machinesEquipped": [
          "Pattern machine for custom stitching designs.",
          "Sewing machine for versatile stitching applications.",
          "Cutting machine for fabric shaping.",
          "Pressing machine for final finishing."
        ],
        "image": "https://i.ibb.co.com/qp7MQTg/t8.png",
        "category": "typical",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "BK-17 Digitally Controlled Button Feeder Attachment",
        "shortDescription": "Digitally controlled button feeder attachment for accurate button application in garment manufacturing.",
        "description": "The BK-17 Digitally Controlled Button Feeder Attachment enhances button placement precision in garment production. This innovative machine streamlines the button application process, increasing efficiency and consistency in high-volume settings. Its user-friendly interface and advanced technology ensure that buttons are fed accurately, significantly reducing manual effort and improving overall productivity.",
        "specifications": {
          "Operation": "Digitally controlled button feeding",
          "Compatibility": "Supports various button types and sizes",
          "Efficiency": "High-speed operation for mass production",
          "Control": "Intuitive digital interface for easy operation"
        },
        "machinesEquipped": [
          "Button feeder for consistent button placement during production.",
          "Sewing machine for attaching buttons accurately to fabrics.",
          "Trimming machine for cleaning up edges post-application.",
          "Pressing machine for final garment finishing and alignment."
        ],
        "image": "https://i.ibb.co.com/CQ5B2VQ/bks1.png",
        "category": "bks",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "BS-21 Automatic Button Wrapping & Knotting",
        "shortDescription": "Automatic machine for wrapping and knotting buttons efficiently for garment production.",
        "description": "The BS-21 Automatic Button Wrapping & Knotting Machine is designed for fast and reliable button finishing. This machine automates the wrapping and knotting process, ensuring secure attachment for buttons on garments. With its high-speed capabilities and robust construction, the BS-21 is essential for manufacturers looking to enhance efficiency and product quality in large-scale operations.",
        "specifications": {
          "Operation": "Automatic wrapping and knotting of buttons",
          "Speed": "High-speed performance for increased productivity",
          "Compatibility": "Handles various button styles and sizes",
          "Automation": "Fully automated for seamless operation"
        },
        "machinesEquipped": [
          "Button wrapping machine for quick finishing tasks.",
          "Sewing machine for final button attachment process.",
          "Trimming machine for neat fabric edges post-application.",
          "Pressing machine for ensuring proper fabric alignment."
        ],
        "image": "https://i.ibb.co.com/bFVC39K/bks2.png",
        "category": "bks",
        "video":"",
      "popularCategory":"popular"
      },
      {
        "title": "SA-20 Button Wrapping and Bonding Machine",
        "shortDescription": "Machine designed for securely wrapping and bonding buttons onto fabrics efficiently.",
        "description": "The SA-20 Button Wrapping and Bonding Machine provides an effective solution for securely attaching buttons to garments. Utilizing advanced bonding technology, it ensures a strong, durable hold. This machine is ideal for high-volume production environments, delivering consistent quality and performance, while significantly reducing the time and labor involved in button application.",
        "specifications": {
          "Operation": "Wrapping and bonding buttons to fabrics",
          "Compatibility": "Accommodates various button types and styles",
          "Efficiency": "Streamlined operation for faster production times",
          "Durability": "Strong bond for long-lasting button attachment"
        },
        "machinesEquipped": [
          "Bonding machine for secure button attachment.",
          "Sewing machine for overall garment assembly.",
          "Trimming machine for finishing fabric edges.",
          "Pressing machine for final garment smoothing."
        ],
        "image": "https://i.ibb.co.com/qCgMPj6/bks3.png",
        "category": "bks",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "SA-3100A Straight & Bias Fabric Rolling Machine",
        "shortDescription": "Efficient fabric rolling machine for straight and bias materials with edge aligning.",
        "description": "The SA-3100A Straight & Bias Fabric Rolling Machine is designed for efficient rolling of various fabrics. Its edge aligning feature ensures accurate and uniform rolls, reducing fabric waste and improving handling. Ideal for garment manufacturers, this machine enhances workflow and organization, making it easier to manage and store rolled fabrics for further processing.",
        "specifications": {
          "Operation": "Rolling of straight and bias fabrics",
          "Edge Alignment": "Precision edge aligning mechanism",
          "Compatibility": "Suitable for various fabric types",
          "Efficiency": "High-speed operation for optimized production"
        },
        "machinesEquipped": [
          "Fabric rolling machine for organized fabric storage.",
          "Sewing machine for assembling rolled fabrics.",
          "Trimming machine for neat fabric edges.",
          "Pressing machine for final smoothing of rolled fabric."
        ],
        "image": "https://i.ibb.co.com/fxmgqkQ/bks4.png",
        "category": "bks",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "SA-2000A Computer Full Automatic Cutting (Slitter) Machine",
        "shortDescription": "Full automatic cutting machine for precise fabric slitting operations.",
        "description": "The SA-2000A Computer Full Automatic Cutting Machine is engineered for high-precision slitting of fabrics. Its computer-controlled system ensures accuracy and consistency in cuts, making it ideal for large-scale fabric production. This machine enhances efficiency and reduces fabric waste, making it a vital tool for garment manufacturers aiming for streamlined operations and high-quality output.",
        "specifications": {
          "Operation": "Full automatic fabric slitting",
          "Control": "Computerized for high accuracy",
          "Precision": "Ensures consistent cutting performance",
          "Compatibility": "Works with various fabric types"
        },
        "machinesEquipped": [
          "Cutting machine for precise fabric slitting.",
          "Sewing machine for subsequent assembly tasks.",
          "Trimming machine for edge finishing.",
          "Pressing machine for ensuring smooth fabric layout."
        ],
        "image": "https://i.ibb.co.com/sg554vy/bks5.png",
        "category": "bks",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "SA-8000 Automatic Aligning & EDGE Stitch of Tubular Form Fabric",
        "shortDescription": "Machine for automatic aligning and edge stitching of tubular fabrics.",
        "description": "The SA-8000 is designed for the automatic aligning and edge stitching of tubular form fabrics. Its advanced technology ensures precise stitching along edges, enhancing garment quality. This machine is perfect for high-volume production, offering reliability and efficiency in edge stitching applications, making it essential for garment manufacturers looking to optimize their production lines.",
        "specifications": {
          "Operation": "Aligning and edge stitching of tubular fabrics",
          "Compatibility": "Designed for tubular fabric types",
          "Efficiency": "High-speed stitching capabilities",
          "Control": "User-friendly controls for easy operation"
        },
        "machinesEquipped": [
          "Edge stitching machine for tubular garments.",
          "Sewing machine for overall garment assembly.",
          "Trimming machine for neat edge finishing.",
          "Pressing machine for smoothing and alignment."
        ],
        "image": "https://i.ibb.co.com/JsWkrsj/bks6.png",
        "category": "bks",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "X-SERIES Jacket and Shirt Fusing Machines Return Version: With Return Belt",
        "shortDescription": "X-SERIES fusing machine with return belt for efficient fabric handling.",
        "description": "The X-SERIES Jacket and Shirt Fusing Machines Return Version is designed to enhance efficiency in fabric fusing. Equipped with a return belt, this machine allows for seamless collection of fused fabrics at the front, ensuring smooth workflow and reducing manual handling. Ideal for high-volume garment production, it guarantees consistent quality and performance.",
        "specifications": {
          "Type": "Jacket and shirt fusing machine",
          "Feature": "Return belt for efficient fabric handling",
          "Functionality": "Automatic fabric fusing with minimal manual intervention",
          "Efficiency": "High-speed operation for increased productivity"
        },
        "machinesEquipped": [
          "Fusing machine for seamless fabric fusion processes.",
          "Feeding belt for continuous fabric supply and handling.",
          "Cutting machine for precise fabric trimming after fusing.",
          "Pressing machine for finalizing garment finishes."
        ],
        "image": "https://i.ibb.co.com/K7kxdx9/m1.png",
        "category": "martin",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "OT-SERIES Jacket and Shirt Fusing Machines Equipped With Return Belt",
        "shortDescription": "OT-SERIES fusing machine with return belt for efficient fabric collection.",
        "description": "The OT-SERIES Jacket and Shirt Fusing Machines is equipped with a return belt, facilitating the collection of fused fabrics at the front. This innovative design optimizes workflow, reduces handling time, and ensures consistent fabric quality. Perfect for garment manufacturers, this machine streamlines the fusing process, enhancing overall production efficiency.",
        "specifications": {
          "Type": "Jacket and shirt fusing machine",
          "Feature": "Return belt for easy fabric collection",
          "Functionality": "Automatic operation for streamlined fusing processes",
          "Productivity": "Designed for high-volume production environments"
        },
        "machinesEquipped": [
          "Fusing machine for efficient fabric bonding.",
          "Feeding belt for managing fabric flow effectively.",
          "Trimming machine for clean edge finishing post-fusing.",
          "Pressing machine for ensuring final garment quality."
        ],
        "image": "https://i.ibb.co.com/0XSSVxg/m2.png",
        "category": "martin",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "Feeding Belt (FB) Loading Extension & Feeding Belts",
        "shortDescription": "Feeding belt extension for enhanced fabric loading and handling.",
        "description": "The Feeding Belt (FB) Loading Extension & Feeding Belts enhances fabric loading and handling for various fusing machines. This extension allows for smoother operation, reducing fabric jams and ensuring continuous supply. Ideal for garment production lines, it improves overall efficiency and reliability in fabric handling, contributing to a more streamlined manufacturing process.",
        "specifications": {
          "Type": "Feeding belt extension",
          "Purpose": "Facilitates smooth fabric loading and handling",
          "Compatibility": "Compatible with various fusing machines",
          "Efficiency": "Enhances operational reliability and speed"
        },
        "machinesEquipped": [
          "Feeding belt for continuous fabric supply during production.",
          "Fusing machine for bonding fabrics efficiently.",
          "Trimming machine for maintaining clean fabric edges.",
          "Pressing machine for achieving quality garment finishes."
        ],
        "image": "https://i.ibb.co.com/qxSB7Ph/m3.png",
        "category": "martin",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "HN-780 Hashima Brand Needle Detector Machine",
        "shortDescription": "High-performance needle detector for ensuring safety in fabric processing.",
        "description": "The HN-780 Hashima Brand Needle Detector Machine is designed to enhance safety in garment production. It effectively detects any metallic contamination, ensuring that fabrics are free from hazardous needles. With advanced technology and high sensitivity, this machine is essential for manufacturers aiming to maintain product quality and protect workers from potential injuries.",
        "specifications": {
          "Type": "Needle detector machine",
          "Brand": "Hashima",
          "Sensitivity": "High sensitivity for detecting metallic contaminants",
          "Functionality": "Automated detection process for efficiency"
        },
        "machinesEquipped": [
          "Needle detector for ensuring fabric safety and quality.",
          "Sewing machine for overall garment assembly and production.",
          "Trimming machine for maintaining clean fabric edges.",
          "Pressing machine for finalizing garment finishes."
        ],
        "image": "https://i.ibb.co.com/NrPY7yk/f1.png",
        "category": "focus",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "HP-900LFS Hashima Brand Fusing Machine",
        "shortDescription": "Efficient fusing machine for high-quality fabric bonding in production.",
        "description": "The HP-900LFS Hashima Brand Fusing Machine is engineered for efficient fabric bonding in garment manufacturing. This machine ensures high-quality fusing results, optimizing production efficiency and consistency. With its user-friendly interface and advanced technology, it is ideal for manufacturers seeking to enhance their fusing processes while maintaining superior fabric quality.",
        "specifications": {
          "Type": "Fusing machine",
          "Brand": "Hashima",
          "Efficiency": "Optimized for high-speed production",
          "Quality": "Ensures high-quality fabric bonding"
        },
        "machinesEquipped": [
          "Fusing machine for effective fabric bonding in production.",
          "Cutting machine for precise fabric trimming.",
          "Sewing machine for garment assembly tasks.",
          "Pressing machine for final garment quality finishing."
        ],
        "image": "https://i.ibb.co.com/NTfv867/f2.png",
        "category": "focus",
        "video":"",
      "popularCategory":"popular"
      },
      {
        "title": "Elastic Joint Machine",
        "shortDescription": "Specialized machine for creating elastic joints in fabrics effectively.",
        "description": "The Elastic Joint Machine is designed for creating durable elastic joints in various fabrics. This specialized equipment ensures efficient and consistent joint formation, making it ideal for garment production involving stretch materials. With advanced technology, it enhances productivity and quality, contributing to improved performance and comfort in finished garments.",
        "specifications": {
          "Type": "Elastic joint machine",
          "Functionality": "Creates strong elastic joints in fabrics",
          "Compatibility": "Suitable for various types of elastic materials",
          "Efficiency": "Optimizes production time and quality"
        },
        "machinesEquipped": [
          "Elastic joint machine for durable fabric joints.",
          "Sewing machine for overall garment assembly.",
          "Cutting machine for precise fabric trimming.",
          "Pressing machine for finalizing garment quality."
        ],
        "image": "https://i.ibb.co.com/Vvwk1HC/f3.png",
        "category": "focus",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "KOSTAR BRAND MODEL SG-555H Fully Automatic Rivet Attaching Machine",
        "shortDescription": "Efficient machine for automatic rivet attachment in garments.",
        "description": "The KOSTAR BRAND MODEL SG-555H Fully Automatic Rivet Attaching Machine is designed for efficient and precise rivet attachment in various garments. This machine automates the riveting process, enhancing production speed and consistency. Ideal for manufacturers seeking to improve workflow, it ensures high-quality rivet application, making it perfect for denim and heavy-duty fabrics.",
        "specifications": {
          "Type": "Fully automatic rivet attaching machine",
          "Brand": "KOSTAR",
          "Functionality": "Automated rivet attachment for high efficiency",
          "Application": "Suitable for various types of fabrics"
        },
        "machinesEquipped": [
          "Rivet attaching machine for fast garment production.",
          "Sewing machine for overall garment assembly.",
          "Cutting machine for precise fabric trimming.",
          "Pressing machine for finalizing garment quality."
        ],
        "image": "https://i.ibb.co.com/WthZwDd/k1.png",
        "category": "kostar",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "KOSTAR BRAND MODEL SG-500H Fully Automatic Tack Button Attaching Machine",
        "shortDescription": "Automatic machine for efficient tack button attachment in apparel.",
        "description": "The KOSTAR BRAND MODEL SG-500H Fully Automatic Tack Button Attaching Machine streamlines the process of attaching tack buttons to garments. This fully automated machine ensures consistent and high-quality button application, enhancing production efficiency. Ideal for apparel manufacturers, it is designed to handle various fabric types, making it a versatile addition to any production line.",
        "specifications": {
          "Type": "Fully automatic tack button attaching machine",
          "Brand": "KOSTAR",
          "Efficiency": "High-speed automatic operation for better productivity",
          "Compatibility": "Works with different types of fabrics"
        },
        "machinesEquipped": [
          "Tack button attaching machine for fast garment production.",
          "Sewing machine for complete garment assembly.",
          "Cutting machine for accurate fabric cutting.",
          "Pressing machine for high-quality garment finishing."
        ],
        "image": "https://i.ibb.co.com/mF0rzyh/k2.png",
        "category": "kostar",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "TBC-52RT Automatic Velcro Cutter",
        "shortDescription": "Automatic cutter designed for precise and efficient Velcro cutting in production processes.",
        "description": "The TBC-52RT Automatic Velcro Cutter is engineered for high-speed, precise cutting of Velcro materials. It automates the cutting process, improving production efficiency and ensuring consistent quality. This machine is ideal for manufacturers working with Velcro-based products, helping streamline workflows and reduce manual labor.",
        "specifications": {
          "Type": "Automatic Velcro cutter",
          "Cutting Speed": "High-speed cutting of Velcro materials",
          "Accuracy": "Ensures precision cuts for consistent product quality",
          "Operation": "Fully automated cutting process for enhanced efficiency"
        },
        "machinesEquipped": [
          "Velcro cutter for fast and efficient production.",
          "Sewing machine for overall garment assembly.",
          "Cutting machine for trimming excess material.",
          "Pressing machine for garment finishing and quality control."
        ],
        "image": "https://i.ibb.co.com/k2XjTjw/c1.png",
        "category": "cutex",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "TBC-50S Automatic Printed Label Cutter",
        "shortDescription": "Efficient machine for cutting printed labels with precision in garment production.",
        "description": "The TBC-50S Automatic Printed Label Cutter is designed for accurate and fast cutting of printed labels. This machine enhances productivity by automating the cutting process, ensuring uniform label sizes and reducing errors. Ideal for garment manufacturers, it supports high-quality label production, optimizing overall efficiency.",
        "specifications": {
          "Type": "Automatic printed label cutter",
          "Cutting Speed": "Optimized for high-speed label cutting",
          "Precision": "Ensures uniform and accurate cuts",
          "Automation": "Reduces manual labor and increases productivity"
        },
        "machinesEquipped": [
          "Label cutter for efficient label production.",
          "Sewing machine for garment assembly and production.",
          "Cutting machine for precise fabric trimming.",
          "Pressing machine for final garment finishing."
        ],
        "image": "https://i.ibb.co.com/6YK5q4j/c2.png",
        "category": "cutex",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "TBC-50SH Automatic Woven Label Cutter",
        "shortDescription": "High-precision automatic cutter for woven labels, designed for efficient garment production workflows.",
        "description": "The TBC-50SH Automatic Woven Label Cutter offers high-precision cutting for woven labels, ideal for large-scale garment production. This machine ensures consistent and accurate cuts, automating the label cutting process to save time and improve efficiency. Perfect for manufacturers focused on woven label applications.",
        "specifications": {
          "Type": "Automatic woven label cutter",
          "Cutting Efficiency": "High-precision cutting for woven labels",
          "Automation": "Fully automated for fast production",
          "Usage": "Ideal for large-scale label production"
        },
        "machinesEquipped": [
          "Woven label cutter for fast and precise production.",
          "Sewing machine for garment assembly and stitching.",
          "Cutting machine for trimming excess fabric.",
          "Pressing machine for finishing garment quality."
        ],
        "image": "https://i.ibb.co.com/gZ74r7V/c3.png",
        "category": "cutex",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "TUC-40S Ultrasonic Label Cutter",
        "shortDescription": "Ultrasonic cutter for labels, providing precise and heat-sealed edges for high-quality garments.",
        "description": "The TUC-40S Ultrasonic Label Cutter uses ultrasonic technology to cut labels with heat-sealed edges, preventing fraying and ensuring durability. This machine is ideal for cutting delicate fabrics and labels, offering precision and consistency in garment manufacturing. It enhances efficiency while maintaining high-quality production standards.",
        "specifications": {
          "Type": "Ultrasonic label cutter",
          "Technology": "Uses ultrasonic technology for heat-sealed edges",
          "Precision": "Provides clean, fray-resistant cuts",
          "Efficiency": "Improves production speed and quality"
        },
        "machinesEquipped": [
          "Ultrasonic cutter for precise, clean label cutting.",
          "Sewing machine for garment assembly and stitching.",
          "Cutting machine for fabric and label trimming.",
          "Pressing machine for garment finishing processes."
        ],
        "image": "https://i.ibb.co.com/9yxKZ66/c4.png",
        "category": "cutex",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "AZ7000SD-8 Overlock/Safety Stitch Machine",
        "shortDescription": "Overlock machine designed for precise safety stitching, ideal for a wide range of garment production.",
        "description": "The AZ7000SD-8 Overlock/Safety Stitch Machine ensures clean, durable stitching for various garments. It's equipped with advanced technology for high-speed, precise overlocking, providing consistent results and improving production efficiency.",
        "specifications": {
          "Type": "Overlock/Safety Stitch machine",
          "Speed": "High-speed for efficient production",
          "Precision": "Delivers clean, durable safety stitches",
          "Automation": "Enhanced automation for improved workflow"
        },
        "machinesEquipped": [
          "Overlock machine for clean stitching.",
          "Sewing machine for garment assembly.",
          "Cutting machine for fabric trimming.",
          "Pressing machine for garment finishing."
        ],
        "image": "https://i.ibb.co.com/QPhqw0c/y1.png",
        "category": "yamato",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "AZF8620SD-8 6 Thread Overlock Machine for Denim, with Variable Top & Bottom Feeder",
        "shortDescription": "6 thread overlock machine for denim with variable top and bottom feeders for efficient stitching.",
        "description": "The AZF8620SD-8 Overlock Machine is designed for denim stitching, equipped with six threads and variable top and bottom feeders. It ensures strong, durable stitches for denim garments, improving the quality and speed of production.",
        "specifications": {
          "Type": "6 Thread Overlock Machine",
          "Feeder": "Variable top and bottom feeders",
          "Application": "Designed for denim stitching",
          "Efficiency": "Improves stitching speed and quality"
        },
        "machinesEquipped": [
          "Overlock machine for denim stitching.",
          "Sewing machine for garment assembly.",
          "Cutting machine for fabric trimming.",
          "Pressing machine for garment finishing."
        ],
        "image": "https://i.ibb.co.com/6m8xjf9/y2.png",
        "category": "yamato",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "AZ8451-45DF Cylinder Bed Overlock Machine for Attaching Elastic Tape",
        "shortDescription": "Cylinder bed overlock machine for elastic tape attachment, ideal for efficient garment production.",
        "description": "The AZ8451-45DF Overlock Machine features a cylinder bed, making it perfect for attaching elastic tape to garments. Its design allows for precise, high-speed attachment, enhancing production efficiency for manufacturers.",
        "specifications": {
          "Type": "Cylinder Bed Overlock Machine",
          "Specialty": "Attaches elastic tape to garments",
          "Speed": "High-speed for fast production",
          "Precision": "Ensures precise elastic attachment"
        },
        "machinesEquipped": [
          "Overlock machine for elastic tape attachment.",
          "Sewing machine for garment assembly.",
          "Cutting machine for fabric trimming.",
          "Pressing machine for garment finishing."
        ],
        "image": "https://i.ibb.co.com/6m8xjf9/y2.png",
        "category": "yamato",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "VC2713G-8F 3(2) Needle 5(4) Thread Cylinder Bed Interlock Stitch Machine For Covering",
        "shortDescription": "Cylinder bed interlock stitch machine for covering, with 3(2) needle and 5(4) thread capability.",
        "description": "The VC2713G-8F Cylinder Bed Interlock Stitch Machine is designed for covering seams with 3(2) needle and 5(4) thread configurations. Its cylinder bed allows for easy stitching on round or tubular sections of garments, increasing production speed and quality.",
        "specifications": {
          "Type": "Cylinder Bed Interlock Stitch Machine",
          "Needles": "3(2) needle, 5(4) thread configurations",
          "Application": "Ideal for seam covering",
          "Speed": "Enhances production speed and quality"
        },
        "machinesEquipped": [
          "Interlock machine for seam covering.",
          "Sewing machine for garment assembly.",
          "Cutting machine for fabric trimming.",
          "Pressing machine for garment finishing."
        ],
        "image": "https://i.ibb.co.com/6mfg07B/y4.png",
        "category": "yamato",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "VE2713-156S-2-K4N-8F/UT High Speed Three Needle Five Thread Cylinder Bed Machine for Plain Seaming With Active Thread Control And Micro Adjustment",
        "shortDescription": "High-speed cylinder bed machine for plain seaming with three needles and five threads, featuring active thread control.",
        "description": "The VE2713-156S-2-K4N-8F/UT is a high-speed cylinder bed machine designed for plain seaming. It comes with three needles, five threads, and active thread control, ensuring precision and quality in garment production.",
        "specifications": {
          "Type": "High-speed cylinder bed machine",
          "Needles": "Three needles, five threads",
          "Control": "Active thread control for precision",
          "Speed": "Enhances seaming efficiency"
        },
        "machinesEquipped": [
          "Cylinder bed machine for plain seaming.",
          "Sewing machine for garment assembly.",
          "Cutting machine for fabric trimming.",
          "Pressing machine for garment finishing."
        ],
        "image": "https://i.ibb.co.com/82hYZk7/y5.png",
        "category": "yamato",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "FD-62SD-12HS 4 Needle Flat-Seamer Feed-off-the-ARM Machine",
        "shortDescription": "Flat-seamer machine with 4 needles for feed-off-the-arm sewing, ideal for high-speed garment production.",
        "description": "The FD-62SD-12HS is a 4-needle flat-seamer feed-off-the-arm machine, perfect for high-speed garment production. Its design allows for fast and precise stitching, especially for seaming applications in the garment industry.",
        "specifications": {
          "Type": "Flat-Seamer Feed-off-the-ARM Machine",
          "Needles": "4 needle configuration",
          "Application": "High-speed feed-off-the-arm stitching",
          "Efficiency": "Improves seaming speed and precision"
        },
        "machinesEquipped": [
          "Flat-seamer for high-speed seaming.",
          "Sewing machine for garment assembly.",
          "Cutting machine for fabric trimming.",
          "Pressing machine for garment finishing."
        ],
        "image": "https://i.ibb.co.com/N1xY0pm/y7.png",
        "category": "yamato",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "VF-2510-188M/K1 FL3/HF-30MM High Speed Flat Bed 3 Needle Double Chain Stitch Machine",
        "shortDescription": "Flat bed chain stitch machine with 3 needles, ideal for high-speed garment production and waistband attachment.",
        "description": "The VF-2510-188M/K1 FL3/HF-30MM is a high-speed flat bed machine with 3 needles, designed for double chain stitching in garment production. It's perfect for waistband attachment and ensures durable, high-quality stitching.",
        "specifications": {
          "Type": "Flat Bed Double Chain Stitch Machine",
          "Needles": "3 needle configuration",
          "Speed": "High-speed for waistband attachment",
          "Durability": "Ensures strong, durable stitches"
        },
        "machinesEquipped": [
          "Chain stitch machine for waistband attachment.",
          "Sewing machine for garment assembly.",
          "Cutting machine for fabric trimming.",
          "Pressing machine for garment finishing."
        ],
        "image": "https://i.ibb.co.com/PZZb65M/y8.png",
        "category": "yamato",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "VG-2735PR-156M-8F/UT-A44 2/3 Needle Interlock Stitch Machine with Rear Puller & Right Fabric Trimmer for Attaching Pre-Closed Elastic Band to Waist of Mens Brief",
        "shortDescription": "Interlock stitch machine with rear puller and fabric trimmer for elastic band attachment on men’s briefs.",
        "description": "The VG-2735PR-156M-8F/UT-A44 is an interlock stitch machine designed for attaching elastic bands to men’s briefs. It features a rear puller and a right fabric trimmer, ensuring precise and efficient stitching in high-speed production environments.",
        "specifications": {
          "Type": "Interlock Stitch Machine with Rear Puller",
          "Application": "Attaches elastic bands to men’s briefs",
          "Trimmer": "Includes fabric trimmer for precision",
          "Speed": "Increases production efficiency"
        },
        "machinesEquipped": [
          "Interlock stitch machine for elastic attachment.",
          "Sewing machine for garment assembly.",
          "Cutting machine for fabric trimming.",
          "Pressing machine for garment finishing."
        ],
        "image": "https://i.ibb.co.com/12ZRQS0/y9.png",
        "category": "yamato",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "Veit Brand Industrial Ironing Tables",
        "shortDescription": "High-performance industrial ironing tables designed for efficient and precise garment pressing.",
        "description": "Veit Brand Industrial Ironing Tables provide high-performance pressing for a wide range of garments. Equipped with advanced features, these tables ensure consistent results, improve efficiency, and are perfect for large-scale garment production.",
        "specifications": {
          "Type": "Industrial Ironing Tables",
          "Efficiency": "High-efficiency pressing performance",
          "Precision": "Ensures consistent pressing results",
          "Durability": "Built for long-term industrial use"
        },
        "machinesEquipped": [
          "Industrial tables for high-quality pressing.",
          "Steam system for effective garment pressing.",
          "Ventilation system for quick drying.",
          "Heat control for optimal performance."
        ],
        "image": "https://i.ibb.co.com/cDqYkf2/v1.png",
        "category": "veit",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "Veit Brand Pants Finisher / Blower Topper VEIT 8741",
        "shortDescription": "Pants finisher with blower topper designed for wrinkle-free and smooth finishing of pants.",
        "description": "The Veit 8741 Pants Finisher/Blower Topper is specifically designed for wrinkle-free, smooth finishing of pants. It ensures efficient garment processing with consistent, high-quality results, ideal for large-scale operations.",
        "specifications": {
          "Type": "Pants Finisher with Blower Topper",
          "Application": "Wrinkle-free finishing of pants",
          "Efficiency": "Improves garment processing time",
          "Durability": "Long-lasting industrial-grade construction"
        },
        "machinesEquipped": [
          "Blower topper for smooth pant finishing.",
          "Heat control system for consistent results.",
          "Wrinkle removal for crisp appearance.",
          "Sturdy design for industrial use."
        ],
        "image": "https://i.ibb.co.com/g3Mr8f1/v2.png",
        "category": "veit",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "Veit Brand VEIT 8410 Knitwear Finisher",
        "shortDescription": "Knitwear finisher designed for efficient processing of knitted garments, providing wrinkle-free results.",
        "description": "The VEIT 8410 Knitwear Finisher is designed to provide high-quality finishing for knitted garments. It ensures wrinkle-free and smooth results while maintaining the shape and texture of delicate knitwear, making it ideal for garment production.",
        "specifications": {
          "Type": "Knitwear Finisher",
          "Application": "Efficient processing of knit garments",
          "Performance": "Wrinkle-free and smooth finishing",
          "Precision": "Maintains texture and shape"
        },
        "machinesEquipped": [
          "Steam system for wrinkle-free results.",
          "Gentle processing for delicate knitwear.",
          "Heat control for optimal finishing.",
          "Durable design for industrial use."
        ],
        "image": "https://i.ibb.co.com/tqZQP12/v3.png",
        "category": "veit",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "Veit Brand Industrial Steam Irons",
        "shortDescription": "High-quality industrial steam irons for precise and effective garment pressing in large-scale production.",
        "description": "Veit Brand Industrial Steam Irons offer high-performance garment pressing with efficient steam technology. Ideal for large-scale production, these irons provide consistent results, ensuring smooth and crisp finishes on various types of fabric.",
        "specifications": {
          "Type": "Industrial Steam Irons",
          "Performance": "High-efficiency steam for precise pressing",
          "Durability": "Industrial-grade for long-term use",
          "Consistency": "Provides smooth, crisp finishes"
        },
        "machinesEquipped": [
          "Steam system for effective pressing.",
          "Heat control for precision ironing.",
          "Ergonomic design for user comfort.",
          "Industrial-grade durability for large production."
        ],
        "image": "https://i.ibb.co.com/zNDn5Yf/v4.png",
        "category": "veit",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "Veit Brand Bagging Machines",
        "shortDescription": "Automatic bagging machines designed for efficient and consistent packaging of garments and textiles.",
        "description": "Veit Brand Bagging Machines automate the packaging process for garments and textiles, ensuring efficient and consistent results. These machines streamline the bagging process, enhancing productivity for large-scale garment manufacturing and distribution.",
        "specifications": {
          "Type": "Automatic Bagging Machines",
          "Application": "Efficient packaging of garments",
          "Automation": "Streamlines bagging process",
          "Durability": "Built for industrial use"
        },
        "machinesEquipped": [
          "Automatic bagging system for garments.",
          "Sealing technology for secure packaging.",
          "Speed control for optimal productivity.",
          "Durable construction for industrial usage."
        ],
        "image": "https://i.ibb.co.com/VD4QfV1/v5.png",
        "category": "veit",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "Veit Brand Fusing Machine FX Diamond 1000 / 1400 / 1400L / 1600",
        "shortDescription": "High-performance fusing machine for bonding fabrics, providing consistent and durable results.",
        "description": "The FX Diamond Fusing Machine series, available in 1000, 1400, 1400L, and 1600 models, is designed for precise fabric bonding. These machines offer high-performance, ensuring strong, durable fusions for various fabric types in garment production.",
        "specifications": {
          "Type": "Fusing Machine",
          "Models": "FX Diamond 1000/1400/1400L/1600",
          "Performance": "Consistent and durable fabric fusions",
          "Application": "Designed for fabric bonding"
        },
        "machinesEquipped": [
          "High-pressure fusing system for strong bonds.",
          "Precision heat control for optimal fusing.",
          "Large surface area for various fabrics.",
          "Durable design for continuous use."
        ],
        "image": "https://i.ibb.co.com/yXvHR1g/v6.png",
        "category": "veit",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "EASTMAN BRAND FABRIC SPREADING MACHINE",
        "shortDescription": "Automatic fabric spreading machine designed for accurate and fast spreading of various fabric types.",
        "description": "The EASTMAN Brand Fabric Spreading Machine offers efficient and accurate spreading for a wide range of fabrics. It enhances production speed and minimizes fabric waste, making it ideal for large-scale garment manufacturing operations.",
        "specifications": {
          "Type": "Fabric Spreading Machine",
          "Function": "Automatic fabric spreading for various fabrics",
          "Efficiency": "Improves production speed and accuracy",
          "Durability": "Built for continuous industrial use"
        },
        "machinesEquipped": [
          "Automated fabric spreading system for accuracy.",
          "High-speed operation for large-scale production.",
          "Reduces fabric waste and saves time.",
          "Durable design for long-term industrial use."
        ],
        "image": "https://i.ibb.co.com/TgMZVVc/e1.png",
        "category": "eastman",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "EASTMAN BRAND FABRIC END CUTTING MACHINE",
        "shortDescription": "Automatic fabric end cutting machine designed for precise trimming and cutting of fabric edges.",
        "description": "The EASTMAN Brand Fabric End Cutting Machine ensures precise trimming of fabric edges, making it ideal for efficient garment production. It enhances accuracy, minimizes waste, and speeds up the cutting process in textile manufacturing.",
        "specifications": {
          "Type": "Fabric End Cutting Machine",
          "Function": "Precise trimming of fabric edges",
          "Efficiency": "Speeds up fabric cutting process",
          "Durability": "Robust construction for industrial usage"
        },
        "machinesEquipped": [
          "Automatic fabric end trimming for precision.",
          "Speeds up fabric cutting operations.",
          "Reduces fabric waste with accurate cuts.",
          "Built for durability and continuous use."
        ],
        "image": "https://i.ibb.co.com/R62vxnD/e2.png",
        "category": "eastman",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "MANUAL CUTTING MACHINE",
        "shortDescription": "Manual cutting machine designed for cutting fabrics with flexibility and control in garment production.",
        "description": "The Manual Cutting Machine offers flexibility and precision in fabric cutting. It is easy to use and provides control over various cutting tasks, making it ideal for small to medium-scale garment manufacturing.",
        "specifications": {
          "Type": "Manual Cutting Machine",
          "Function": "Manual cutting of fabrics",
          "Flexibility": "Offers control for various cutting tasks",
          "Ease of Use": "Simple to operate"
        },
        "machinesEquipped": [
          "Manual operation for fabric cutting flexibility.",
          "Easy to handle and operate.",
          "Provides control over cutting tasks.",
          "Durable design for long-term use."
        ],
        "image": "https://i.ibb.co.com/9G2qtwP/e3.png",
        "category": "eastman",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "EASTMAN BRAND KNIFE MACHINE",
        "shortDescription": "Knife cutting machine designed for fast and accurate cutting of fabrics in garment production.",
        "description": "The EASTMAN Brand Knife Machine offers fast and precise cutting of various fabrics. It is engineered for high-speed performance, ensuring efficiency and accuracy in large-scale garment manufacturing operations.",
        "specifications": {
          "Type": "Knife Cutting Machine",
          "Performance": "High-speed fabric cutting",
          "Accuracy": "Ensures precision in cutting",
          "Durability": "Engineered for industrial-grade use"
        },
        "machinesEquipped": [
          "High-speed knife cutting for precision.",
          "Suitable for large-scale garment production.",
          "Accurate and efficient fabric cutting.",
          "Durable and built for continuous operation."
        ],
        "image": "https://i.ibb.co.com/CB64jxG/e4.png",
        "category": "eastman",
        "video":"",
      "popularCategory":""
      },
      {
        "title": "Vertical Type Multi-Fuel & Biomass Boiler",
        "shortDescription": "Efficient vertical boiler designed for multi-fuel and biomass combustion, ideal for industrial energy needs.",
        "description": "The Vertical Type Multi-Fuel & Biomass Boiler provides efficient energy solutions by utilizing multiple fuel types and biomass. It is designed for high performance and long-term industrial use, ensuring sustainable and cost-effective energy production.",
        "specifications": {
          "Type": "Vertical Boiler",
          "Fuel": "Multi-Fuel & Biomass",
          "Efficiency": "High energy output with minimal waste",
          "Design": "Vertical structure for space efficiency"
        },
        "machinesEquipped": [
          "Supports multi-fuel and biomass energy sources.",
          "Space-saving vertical design for industrial use.",
          "Provides high energy output efficiently.",
          "Durable design for long-term operation."
        ],
        "image": "https://i.ibb.co.com/8KftWg6/s1.png",
        "category": "samwoo_boiler",
        "video":"https://youtu.be/VIlya8sEW2g?si=vr0iIoLUAYbvcfkj",
      "popularCategory":""
      },
      {
        "title": "Multifuel & Biomass Duel Vertical Type Boiler",
        "shortDescription": "Dual vertical boiler designed for multi-fuel and biomass use, offering high efficiency and energy output.",
        "description": "The Multifuel & Biomass Duel Vertical Type Boiler is designed to support both multi-fuel and biomass combustion. Its vertical structure saves space and provides reliable energy production for industrial applications, ensuring cost-effective operations.",
        "specifications": {
          "Type": "Vertical Duel Boiler",
          "Fuel": "Multi-Fuel & Biomass",
          "Design": "Space-efficient vertical layout",
          "Output": "High energy performance with minimal emissions"
        },
        "machinesEquipped": [
          "Dual fuel options for flexible energy use.",
          "Vertical structure for space efficiency.",
          "Supports biomass for eco-friendly energy.",
          "Reliable and long-lasting industrial use."
        ],
        "image": "https://i.ibb.co.com/W5Vw1J5/s2.png",
        "category": "samwoo_boiler",
         "video":"",
      "popularCategory":"popular"
      },
      {
        "title": "Multi-Fuel & Biomass Boiler (Horizontal Dual Type)",
        "shortDescription": "Horizontal dual-type boiler for multi-fuel and biomass use, providing efficient energy production for industries.",
        "description": "The Multi-Fuel & Biomass Boiler (Horizontal Dual Type) is a high-efficiency system designed for industrial energy needs. It supports both multi-fuel and biomass combustion, making it a versatile and sustainable choice for large-scale operations.",
        "specifications": {
          "Type": "Horizontal Dual Boiler",
          "Fuel": "Multi-Fuel & Biomass",
          "Efficiency": "High energy output with eco-friendly operation",
          "Design": "Horizontal layout for industrial applications"
        },
        "machinesEquipped": [
          "Supports dual fuel and biomass usage.",
          "Horizontal design for industrial scale production.",
          "Efficient energy output with minimal emissions.",
          "Durable and reliable for long-term use."
        ],
        "image": "https://i.ibb.co.com/m4fZ0mQ/s3.png",
        "category": "samwoo_boiler",
        "video":"https://youtu.be/FNA_O_3ipps?si=FL40aGdEY2PDg3cK",
      "popularCategory":""
      },
      {
        "title": "Samwoo Boiler Automatic Loading System",
        "shortDescription": "Automatic loading system for Samwoo boilers, designed to enhance efficiency and operational ease.",
        "description": "The Samwoo Boiler Automatic Loading System ensures continuous and efficient fuel loading for boilers, reducing manual intervention and improving overall operational efficiency in industrial settings.",
        "specifications": {
          "Type": "Automatic Loading System",
          "Compatibility": "Samwoo Boilers",
          "Efficiency": "Automated fuel loading for uninterrupted operation",
          "Design": "Streamlined and easy to integrate"
        },
        "machinesEquipped": [
          "Automated fuel loading for Samwoo boilers.",
          "Reduces manual labor and intervention.",
          "Ensures continuous and efficient operation.",
          "Compatible with various Samwoo boiler models."
        ],
        "image": "https://i.ibb.co.com/VLKgx9r/s4.png",
        "category": "samwoo_boiler",
         "video":"https://youtu.be/FOKV8t_vnk4?si=i6gPRc_cdak7yc71",
      "popularCategory":""
      },
      {
        "title": "Vertical Type Duel Fuel Boiler",
        "shortDescription": "Vertical dual fuel boiler supporting efficient energy production from multiple fuel sources for industrial use.",
        "description": "The Vertical Type Duel Fuel Boiler offers energy efficiency with its support for dual fuel sources. Its vertical design makes it ideal for space-conscious industrial environments, providing reliable energy output for various operations.",
        "specifications": {
          "Type": "Vertical Duel Fuel Boiler",
          "Fuel": "Dual Fuel",
          "Efficiency": "Optimized energy production with space-saving design",
          "Durability": "Built for industrial-grade reliability"
        },
        "machinesEquipped": [
          "Dual fuel capability for versatile energy use.",
          "Vertical structure saves industrial floor space.",
          "Provides reliable energy for industrial applications.",
          "Durable and efficient for long-term use."
        ],
        "image": "https://i.ibb.co.com/QCMmWY7/s5.png",
        "category": "samwoo_boiler",
         "video":"",
      "popularCategory":""
      },
      {
        "title": "Horizontal Type Duel/Fuel Boiler",
        "shortDescription": "Horizontal dual fuel boiler designed for efficient energy production using multiple fuel sources in industrial settings.",
        "description": "The Horizontal Type Duel/Fuel Boiler is engineered for high energy output using dual fuel sources. Its horizontal design suits large-scale industrial environments, delivering reliable and consistent energy for demanding applications.",
        "specifications": {
          "Type": "Horizontal Duel Fuel Boiler",
          "Fuel": "Dual Fuel",
          "Efficiency": "High energy output with flexibility in fuel use",
          "Design": "Horizontal structure for industrial settings"
        },
        "machinesEquipped": [
          "Supports dual fuel for versatile energy use.",
          "Horizontal design for industrial-scale applications.",
          "Ensures high energy efficiency and reliability.",
          "Built for continuous industrial operation."
        ],
        "image": "https://i.ibb.co.com/gV3Q7tr/s6.png",
        "category": "samwoo_boiler",
         "video":"",
      "popularCategory":""
      }
  ]
  